# BreakPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPattern..::..BreakPattern Property
BalusterPattern Class See Also
---
The condition which controls breaking baluster patterns distribution.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public BreakPatternCondition BreakPattern { get; set; }
```

Visual Basic
---
```text
Public Property BreakPattern As BreakPatternCondition
	Get
	Set
```

Visual C++
---
```text
public:
property BreakPatternCondition BreakPattern {
	BreakPatternCondition get ();
	void set (BreakPatternCondition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace